{
  "vocab_size": 100,
  "vocab": [
    "TTACAG",
    "GTACGT",
    "CAGATTA",
    "AGATTAC",
    "GTAC",
    "TACAGATTA",
    "GTACGTGA",
    "GATTACAGAT",
    "AGATTA",
    "ACGTAC",
    "CGTACGTGAT",
    "CGTACGTGA",
    "ATTACAG",
    "GTACGTGAT",
    "TAC",
    "TTACA",
    "ACAGA",
    "TT",
    "TTAC",
    "GCT",
    "C",
    "CGTACGTG",
    "TA",
    "T",
    "ACAGATTACA",
    "GATTACAG",
    "ACAGAT",
    "ACGTACG",
    "ACA",
    "AC",
    "ACG",
    "TACGTGATT",
    "CAGATTAC",
    "ATTACAGATT",
    "TACGTGAT",
    "CAG",
    "TACA",
    "GATTACAGA",
    "TTACAGA",
    "TACAGATT",
    "ACGTACGTG",
    "CAGA",
    "CGTACGT",
    "ATTACAGAT",
    "CGT",
    "ACGTACGT",
    "TACGT",
    "GTACG",
    "TACAGATTAC",
    "TTA",
    "GTA",
    "TACGTGA",
    "AGATT",
    "GA",
    "GATTACA",
    "TACAGA",
    "TACAG",
    "CA",
    "GT",
    "TTACAGATTA",
    "ATTACA",
    "GATTA",
    "TACGTGATTA",
    "CAGATT",
    "GATT",
    "ACAGATTA",
    "ACAGATTAC",
    "GATTAC",
    "ATTAC",
    "TACAGAT",
    "ACAGATT",
    "TACGTG",
    "CAGAT",
    "G",
    "TACG",
    "A",
    "CGTAC",
    "ATT",
    "GC",
    "CGTACG",
    "AG",
    "ACAG",
    "ACGTA",
    "GTACGTGATT",
    "ATTACAGA",
    "GAT",
    "TTACAGAT",
    "TTACAGATT",
    "AGATTACA",
    "ACGTACGTGA",
    "AGA",
    "CAGATTACA",
    "ACGT",
    "AT",
    "AGAT",
    "ATTA",
    "CGTA",
    "CT",
    "GTACGTG",
    "CG"
  ],
  "token2id": {
    "A": 0,
    "AC": 1,
    "ACA": 2,
    "ACAG": 3,
    "ACAGA": 4,
    "ACAGAT": 5,
    "ACAGATT": 6,
    "ACAGATTA": 7,
    "ACAGATTAC": 8,
    "ACAGATTACA": 9,
    "ACG": 10,
    "ACGT": 11,
    "ACGTA": 12,
    "ACGTAC": 13,
    "ACGTACG": 14,
    "ACGTACGT": 15,
    "ACGTACGTG": 16,
    "ACGTACGTGA": 17,
    "AG": 18,
    "AGA": 19,
    "AGAT": 20,
    "AGATT": 21,
    "AGATTA": 22,
    "AGATTAC": 23,
    "AGATTACA": 24,
    "AT": 25,
    "ATT": 26,
    "ATTA": 27,
    "ATTAC": 28,
    "ATTACA": 29,
    "ATTACAG": 30,
    "ATTACAGA": 31,
    "ATTACAGAT": 32,
    "ATTACAGATT": 33,
    "C": 34,
    "CA": 35,
    "CAG": 36,
    "CAGA": 37,
    "CAGAT": 38,
    "CAGATT": 39,
    "CAGATTA": 40,
    "CAGATTAC": 41,
    "CAGATTACA": 42,
    "CG": 43,
    "CGT": 44,
    "CGTA": 45,
    "CGTAC": 46,
    "CGTACG": 47,
    "CGTACGT": 48,
    "CGTACGTG": 49,
    "CGTACGTGA": 50,
    "CGTACGTGAT": 51,
    "CT": 52,
    "G": 53,
    "GA": 54,
    "GAT": 55,
    "GATT": 56,
    "GATTA": 57,
    "GATTAC": 58,
    "GATTACA": 59,
    "GATTACAG": 60,
    "GATTACAGA": 61,
    "GATTACAGAT": 62,
    "GC": 63,
    "GCT": 64,
    "GT": 65,
    "GTA": 66,
    "GTAC": 67,
    "GTACG": 68,
    "GTACGT": 69,
    "GTACGTG": 70,
    "GTACGTGA": 71,
    "GTACGTGAT": 72,
    "GTACGTGATT": 73,
    "T": 74,
    "TA": 75,
    "TAC": 76,
    "TACA": 77,
    "TACAG": 78,
    "TACAGA": 79,
    "TACAGAT": 80,
    "TACAGATT": 81,
    "TACAGATTA": 82,
    "TACAGATTAC": 83,
    "TACG": 84,
    "TACGT": 85,
    "TACGTG": 86,
    "TACGTGA": 87,
    "TACGTGAT": 88,
    "TACGTGATT": 89,
    "TACGTGATTA": 90,
    "TT": 91,
    "TTA": 92,
    "TTAC": 93,
    "TTACA": 94,
    "TTACAG": 95,
    "TTACAGA": 96,
    "TTACAGAT": 97,
    "TTACAGATT": 98,
    "TTACAGATTA": 99
  },
  "id2token": {
    "0": "A",
    "1": "AC",
    "2": "ACA",
    "3": "ACAG",
    "4": "ACAGA",
    "5": "ACAGAT",
    "6": "ACAGATT",
    "7": "ACAGATTA",
    "8": "ACAGATTAC",
    "9": "ACAGATTACA",
    "10": "ACG",
    "11": "ACGT",
    "12": "ACGTA",
    "13": "ACGTAC",
    "14": "ACGTACG",
    "15": "ACGTACGT",
    "16": "ACGTACGTG",
    "17": "ACGTACGTGA",
    "18": "AG",
    "19": "AGA",
    "20": "AGAT",
    "21": "AGATT",
    "22": "AGATTA",
    "23": "AGATTAC",
    "24": "AGATTACA",
    "25": "AT",
    "26": "ATT",
    "27": "ATTA",
    "28": "ATTAC",
    "29": "ATTACA",
    "30": "ATTACAG",
    "31": "ATTACAGA",
    "32": "ATTACAGAT",
    "33": "ATTACAGATT",
    "34": "C",
    "35": "CA",
    "36": "CAG",
    "37": "CAGA",
    "38": "CAGAT",
    "39": "CAGATT",
    "40": "CAGATTA",
    "41": "CAGATTAC",
    "42": "CAGATTACA",
    "43": "CG",
    "44": "CGT",
    "45": "CGTA",
    "46": "CGTAC",
    "47": "CGTACG",
    "48": "CGTACGT",
    "49": "CGTACGTG",
    "50": "CGTACGTGA",
    "51": "CGTACGTGAT",
    "52": "CT",
    "53": "G",
    "54": "GA",
    "55": "GAT",
    "56": "GATT",
    "57": "GATTA",
    "58": "GATTAC",
    "59": "GATTACA",
    "60": "GATTACAG",
    "61": "GATTACAGA",
    "62": "GATTACAGAT",
    "63": "GC",
    "64": "GCT",
    "65": "GT",
    "66": "GTA",
    "67": "GTAC",
    "68": "GTACG",
    "69": "GTACGT",
    "70": "GTACGTG",
    "71": "GTACGTGA",
    "72": "GTACGTGAT",
    "73": "GTACGTGATT",
    "74": "T",
    "75": "TA",
    "76": "TAC",
    "77": "TACA",
    "78": "TACAG",
    "79": "TACAGA",
    "80": "TACAGAT",
    "81": "TACAGATT",
    "82": "TACAGATTA",
    "83": "TACAGATTAC",
    "84": "TACG",
    "85": "TACGT",
    "86": "TACGTG",
    "87": "TACGTGA",
    "88": "TACGTGAT",
    "89": "TACGTGATT",
    "90": "TACGTGATTA",
    "91": "TT",
    "92": "TTA",
    "93": "TTAC",
    "94": "TTACA",
    "95": "TTACAG",
    "96": "TTACAGA",
    "97": "TTACAGAT",
    "98": "TTACAGATT",
    "99": "TTACAGATTA"
  }
}